_base_template/0.template/contactResistance
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    location "0";
    object contactResistance;
}
// Numerical values are local effective series resistance in ohm m2.
dimensions [0 0 0 0 0 0 0];
internalField uniform 0;
boundaryField { ".*" { type zeroGradient; } }
