_base_template/0.template/oxygenDiffusivityMultiplier
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    location "0";
    object oxygenDiffusivityMultiplier;
}
dimensions [0 0 0 0 0 0 0];
internalField uniform 1;
boundaryField { ".*" { type zeroGradient; } }
