_base_template/constant/speciesProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      speciesProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

O2
{
    diffusionModel  constant;
    D	D	[0 2 -1 0 0 0 0]         2e-5;
}

/*
s2
{
    diffusionModel  constant;
    D	D	[0 2 -1 0 0 0 0]	7.2e-8;
}
*/
/*
s3
{
    diffusionModel  constant;
    D	D	[0 2 -1 0 0 0 0]	6.2e-6;
}

s4
{
    diffusionModel  constant;
    D	D	[0 2 -1 0 0 0 0]	5.2e-6;
}
*/


// ************************************************************************* //
