_base_template/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water air);

water
{
    transportModel  Newtonian;
    nu              1.00e-06;
    rho             1000;
}

air
{
      transportModel  Newtonian;
    nu             1.58E-05;
    rho             1.3;
}
sigma 0.072;

transportModel  Newtonian;
nu              [0 2 -1 0 0 0 0] 1.00e-04; //kinematic viscosity

//----- Fuel Cell Operating Parameters -----//

// Choose Kinetic Model: Tafel or ButlerVolmer
//kineticModel Tafel; 
kineticModel ButlerVolmer;

C_0 		5.15;	// Reference Concentration (value at j0) [mol/m3]
b_c  		-0.057;	// Tafel slope cathode (negative) [V]
j_0c  		-1.5;	// Exchange Current Density cathode (negative) [A/m2]
b_a  		0.057;   // Tafel slope anode (positive) [V]
j_0a  		200;	// Exchange Current Density anode (negative) [A/m2]
delta_m  	50e-6;	// Membrane thickness [m]
k_m  		10;	// Membrane conductivity [S/m]
E0_c  		1.23;	// Equalibrium Potential Cathode [V]
R 		8.314;  // Gas constant [J mol-1 k-1]
T 		343;	// Temperature [K]
alpha_a 	0.5;	// Anode transfer coefficient [-]
alpha_c 	-0.5;   // Cathode transfer coefficient [-] (negative)
F 		96485;	// Faraday Constant [C/mol]

poreDiameter poreDiameter [0 1 0 0 0 0 0] 50e-6;
rho rho [1 -3 0 0 0 0 0] 1.3;
//C_F 3500; //1.75/Dp
C_F 3;
useForchheimer "on";
tau	tau [0 0 0 0 0 0 0] 2;
// V2 defaults; the validation runner sets tau and j_0c for each stage.
tauInPlane 1.0;
tauThroughPlane 2.0;

// ************************************************************************* //
