_base_template/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }
convertToMeters 1;
vertices
(
    (-0.0038 -0.0040 0) (0.0038 -0.0040 0) (0.0038 0.0040 0) (-0.0038 0.0040 0)
    (-0.0038 -0.0040 0.00128) (0.0038 -0.0040 0.00128) (0.0038 0.0040 0.00128) (-0.0038 0.0040 0.00128)
);
blocks (hex (0 1 2 3 4 5 6 7) (76 80 20) simpleGrading (1 1 1));
edges ();
boundary
(
    inlet { type patch; faces ((0 1 5 4)); }
    outlet { type patch; faces ((3 7 6 2)); }
    wallWest { type wall; faces ((0 4 7 3)); }
    wallEast { type wall; faces ((1 2 6 5)); }
    catalyst { type wall; faces ((0 3 2 1)); }
    top { type wall; faces ((4 5 6 7)); }
);
